docs: big readme update
